Project/Toir/src/DataProcessors/торо_ПодборОбъектовРемонтныхРабот/торо_ПодборОбъектовРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ПодборОбъектовРемонтныхРабот</name>
</mdclass:DataProcessor>

Project/Toir/src/InformationRegisters/торо_НормативныеРемонтыОборудования/торо_НормативныеРемонтыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудования</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьПростоиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникСтратегии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ПараметрыНаработкиОбъектовРемонта/торо_ПараметрыНаработкиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПараметрыНаработкиОбъектовРемонта</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПлановаяНаработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПлановойНаработки</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>ПродолжительностьПериодаПлановойНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентИспользованияОборудования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>гкс_ЗначениеУведомления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ВариантыУчетаИерархииЭлементовПриПодборе/торо_ВариантыУчетаИерархииЭлементовПриПодборе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВариантыУчетаИерархииЭлементовПриПодборе</name>
  <enumValues>
    <name>НеУчитыватьИерархию</name>
  </enumValues>
  <enumValues>
    <name>УчитыватьИерархиюТолько1Уровня</name>
  </enumValues>
  <enumValues>
    <name>УчитыватьИерархию1Уровня</name>
  </enumValues>
  <enumValues>
    <name>УчитыватьИерархию</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ВидыОперацийОтклоненияВРаботеОборудования/торо_ВидыОперацийОтклоненияВРаботеОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыОперацийОтклоненияВРаботеОборудования</name>
  <enumValues>
    <name>ВидЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ВидЭксплуатацииНаПериод</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Организация</name>
    <comment>TOIR20-580</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/DataProcessors/торо_ПодборОбъектовРемонтныхРабот/Forms/ФормаПодбораОбъектовДляПланаГрафикаППР/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(КлючНазначенияИспользования) Тогда
		ТекстСообщения = НСтр("es='El tratamiento no es destinado al uso directo.';ru='Обработка не предназначена для непосредственного использования.';en='Processing is not intended for direct use.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("СтруктураИерархии") И ЗначениеЗаполнено(Параметры.СтруктураИерархии) Тогда
		ТекСтруктураИерархии = Параметры.СтруктураИерархии;
	Иначе
		ТекСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Истина);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТекСтруктураИерархии) Тогда
		ТекСтруктураИерархии = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	КонецЕсли;
	
	Если Параметры.Свойство("ВернутьИерархию") Тогда
		ВернутьИерархию = Параметры.ВернутьИерархию;
	КонецЕсли;

	ЗаполнитьПараметрыНазначенияИспользования(Параметры);
	
	ЗапрашиватьВидРемонтныхРабот 		= Истина;
	ЗапрашиватьВидПараметровНаработки 	= Истина;
	
	ЭтаФорма.ОрганизацияДляОтбора = ?(Параметры.Свойство("Организация"), Параметры.Организация, Справочники.Организации.ПустаяСсылка());
	ЭтаФорма.ПодразделениеДляОтбора = ?(Параметры.Свойство("Подразделение"), Параметры.Подразделение, Справочники.СтруктураПредприятия.ПустаяСсылка());
	ЭтаФорма.НеУчаствуетВПланировании = ?(Параметры.Свойство("НеУчаствуетВПланировании"), Параметры.НеУчаствуетВПланировании, Ложь);
	
	Элементы.ОрганизацияДляОтбора.Видимость = ЗначениеЗаполнено(ЭтаФорма.ОрганизацияДляОтбора);
	Элементы.ПодразделениеДляОтбора.Видимость = ЗначениеЗаполнено(ЭтаФорма.ПодразделениеДляОтбора);
	
	ДополнительныеОтборы = Новый Массив;
	Если ЗначениеЗаполнено(ОрганизацияДляОтбора) Тогда
		СтруктураОтбра = Новый Структура("Ключ, Значение", "Организация", ОрганизацияДляОтбора);
		ДополнительныеОтборы.Добавить(СтруктураОтбра);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПодразделениеДляОтбора) Тогда
		СтруктураОтбра = Новый Структура("Ключ, Значение, ВидСравнения", "Подразделение", ПодразделениеДляОтбора, ВидСравненияКомпоновкиДанных.ВИерархии);
		ДополнительныеОтборы.Добавить(СтруктураОтбра);
	КонецЕсли;
	Если НеУчаствуетВПланировании = Истина Тогда
		СтруктураОтбра = Новый Структура("Ключ, Значение", "НеУчаствуетВПланировании", Ложь);
		ДополнительныеОтборы.Добавить(СтруктураОтбра);
	КонецЕсли;
	
	Если Параметры.Свойство("СписокОР") Тогда
		СтруктураОтбра = Новый Структура("Ключ, Значение, ВидСравнения", "Ссылка", Параметры.СписокОР, ВидСравненияКомпоновкиДанных.ВСписке);
		ДополнительныеОтборы.Добавить(СтруктураОтбра);
	КонецЕсли; 
	
	ФОИспользоватьДокументыЖЦОборудования = ПолучитьФункциональнуюОпцию("торо_ИспользоватьДокументыПринятияИСписанияОборудования");
	ПолучатьСтатусыВУчетеДляДерева = ФОИспользоватьДокументыЖЦОборудования;
	
	Если Не ФОИспользоватьДокументыЖЦОборудования Тогда
		Элементы.СтатусВУчете.Видимость = Ложь;
	КонецЕсли;
	
	Если ФОИспользоватьДокументыЖЦОборудования Тогда
		ИсключитьНепринятые = (ВидПодбора = "ВидПараметровНаработки"
						  ИЛИ ВидПодбора = "СостоянияОР"
						  ИЛИ ВидПодбора = "ВводНачальныхДанных");

		МассивСтатусов = торо_СтатусыОРВУчете.СписокСтатусовДляПодбора(ИсключитьНепринятые);
		СписокСтатусов.ЗагрузитьЗначения(МассивСтатусов);
	КонецЕсли;
	
	// Сейчас не используется, т.к. в прежней форме не работало. 
	// Но потенциально может использоваться как 
	// "ДатаСреза" для построения дерева, списка и отбора данных.
	Если Параметры.Свойство("ДатаДокумента") Тогда
		ДатаДокумента = Параметры.ДатаДокумента;
	КонецЕсли;
		
	ОбработатьИзменениеИерархииНаСервере();
	
	Если Параметры.Свойство("ЗапретитьИзменениеИерархии") И Параметры.ЗапретитьИзменениеИерархии = Истина Тогда
		Элементы.ФормаНастройкаИерархии.Доступность = Ложь;
	КонецЕсли;
	
	ВариантУчетаИерархииЭлементов = Перечисления.торо_ВариантыУчетаИерархииЭлементовПриПодборе.НеУчитыватьИерархию;
	
	Элементы.СтраницыФормы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	ИспользоватьКартинкиТОР = Константы.торо_ИспользоватьКартинкиТиповыхОбъектов.Получить();
	Если ИспользоватьКартинкиТОР Тогда 
		Элементы.Дерево.ПутьКДаннымКартинкиСтроки = "Дерево.КартинкаОтображаемая";
		Элементы.ДеревоПолное.ПутьКДаннымКартинкиСтроки = "ДеревоПолное.КартинкаОтображаемая";
	Иначе 
		Элементы.Дерево.ПутьКДаннымКартинкиСтроки = "Дерево.Картинка";
		Элементы.ДеревоПолное.ПутьКДаннымКартинкиСтроки = "ДеревоПолное.Картинка";
	КонецЕсли;    
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	торо_РаботаСИерархией20Клиент.УстановитьДоступностьКомандФормы(ЭтаФорма);
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененаПометкаУдаленияОР" Тогда
		торо_РаботаСИерархией20Клиент.ОбработкаОповещенияОбИзмененииПометкиУдаленияОбъектаРемонта(ЭтаФорма, Параметр);
		Если ИспользоватьКартинкиТОР Тогда
			ОбновитьКартинкиЭлементовПолногоДереваНаСервере();
			ОбновитьКартинкиЭлементовДереваНаСервере();
		КонецЕсли; 		
	ИначеЕсли ИмяСобытия = "ЗаписанОбъектРемонта" Тогда
		торо_РаботаСИерархией20Клиент.ОбработкаОповещенияОЗаписиОбъектаРемонта(ЭтаФорма, Параметр);
		Если ИспользоватьКартинкиТОР Тогда
			ОбновитьКартинкиЭлементовПолногоДереваНаСервере();
			ОбновитьКартинкиЭлементовДереваНаСервере();
		КонецЕсли; 
	ИначеЕсли ИмяСобытия = "ИзмененПорядокОбъектаРемонта" Тогда
		Если Параметр.СтруктураИерархии = ТекСтруктураИерархии Тогда
			торо_НастройкаПорядкаЭлементовКлиент.ИзменитьПорядокЭлементаВДереве(ЭтаФорма, Параметр);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзмененаСтруктураИерархииОР" Тогда
		Если Параметр = Неопределено ИЛИ Параметр = ТекСтруктураИерархии Тогда
			торо_РаботаСИерархией20Клиент.ОбновитьДеревоИерархии(ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыборОбъектаРемонта();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьНаВидДерева(Команда)
	
	Если ТекущийЭлемент = Элементы.Дерево Тогда
		ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Ссылка) <> Тип("СправочникСсылка.торо_ОбъектыРемонта") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если КореньПолногоДерева <> ТекущиеДанные.Ссылка Тогда
		КореньПолногоДерева = ТекущиеДанные.Ссылка;
		торо_РаботаСИерархией20КлиентСервер.ПостроитьДеревоСКонечнымиЭлементами(ДеревоПолное, СтруктураПараметровИерархии, КореньПолногоДерева, ПолучатьСтатусыВУчетеДляДерева, СписокСтатусов, ДополнительныеОтборы);
		СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма, "ДеревоПолное",,Истина);
	КонецЕсли;
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаДеревоПолное;
	
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовПолногоДереваНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьНаОбычныйВид(Команда)
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОбычныйВид;
	
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовДереваНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПолноеДерево(Команда)
	
	торо_РаботаСИерархией20КлиентСервер.ПостроитьДеревоСКонечнымиЭлементами(ДеревоПолное, СтруктураПараметровИерархии, КореньПолногоДерева, ПолучатьСтатусыВУчетеДляДерева, СписокСтатусов, ДополнительныеОтборы);
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма, "ДеревоПолное",,Истина);
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовПолногоДереваНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаполнитьПоНормативамПриИзменении(Элемент)
	
	ОбновитьДоступностьФлагов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДерево

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	торо_РаботаСИерархией20Клиент.УправлениеОтборомВСписке(ЭтаФорма);
	торо_РаботаСИерархией20Клиент.УстановитьДоступностьКомандДереваПриАктивизацииСтроки(ЭтаФорма, Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередРазворачиванием(Элемент, Строка, Отказ)
		
	торо_РаботаСИерархией20Клиент.ДеревоПередРазворачиванием(Дерево, Строка, СтруктураПараметровИерархии, ПолучатьСтатусыВУчетеДляДерева, СписокСтатусов, ДополнительныеОтборы);
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовДереваНаСервере(Строка);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломИзменения(Элемент, Отказ)
	
	торо_РаботаСИерархией20Клиент.ПередНачаломИзменения(Элемент, Отказ, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборОбъектаРемонта();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПолноеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборОбъектаРемонта();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		торо_РаботаСИерархией20Клиент.ВыделитьРодителяВДереве(ЭтаФорма, ТекущиеДанные);
	КонецЕсли;
	
	торо_РаботаСИерархией20Клиент.УстановитьДоступностьКомандСпискаПриАктивизацииСтроки(ЭтаФорма, Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	торо_РаботаСИерархией20Клиент.ПередНачаломИзменения(Элемент, Отказ, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("Массив") Тогда
		ВыбранноеЗначение = Элементы.Список.ТекущиеДанные.Ссылка;
	Иначе
		ВыбранноеЗначение = ВыбраннаяСтрока;
	КонецЕсли;
	торо_РаботаСИерархией20Клиент.СписокВыбор(Элемент, ВыбранноеЗначение, Поле, СтандартнаяОбработка, ЭтаФорма);
	
	// Если кликнули не на элемент с подчиненными, то СтандартнаяОбработка сброшена не будет,
	// и можно реализовывать выбор элемента.
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка = Ложь;
		ВыборОбъектаРемонта();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ИспользоватьКартинкиТОР = Константы.торо_ИспользоватьКартинкиТиповыхОбъектов.Получить();
	торо_РаботаСИерархией20.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки, ИспользоватьКартинкиТОР);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаВыборкаЗначения

&НаКлиенте
Процедура ВыборОбъектаРемонта()
	
	УчтываетсяИерархияЭлементов = ЗначениеЗаполнено(ВариантУчетаИерархииЭлементов)
		И ВариантУчетаИерархииЭлементов <> ПредопределенноеЗначение("Перечисление.торо_ВариантыУчетаИерархииЭлементовПриПодборе.НеУчитыватьИерархию");
	
	МассивВыбранныхСтрок = торо_РаботаСИерархией20Клиент.ПолучитьМассивДанныхВыделенныхСтрок(ЭтаФорма,,,УчтываетсяИерархияЭлементов);
	
	Если МассивВыбранныхСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если УчтываетсяИерархияЭлементов Тогда
		
		МассивВыбранныхСтрок = торо_РаботаСИерархией20.ДополнитьОтобратьМассивВыбранныхСтрок(МассивВыбранныхСтрок, ВариантУчетаИерархииЭлементов, ТекСтруктураИерархии, Ложь,,СписокСтатусов, ДополнительныеОтборы);
		
		Если МассивВыбранныхСтрок.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;

	КонецЕсли;
	
	НаличиеДанныхПомеченныхНаУдаление = Ложь;

	Для Каждого ДанныеСтр Из МассивВыбранныхСтрок Цикл
		
		Если торо_РаботаСИерархией20КлиентСервер.ЭтоОбычнаяГруппаПоКартинке(ДанныеСтр.ИндексКартинки) Тогда
			ТекстСообщения = НСтр("es='¡No es posible escoger el grupo!';ru='Нельзя выбрать группу!';en='Can not choose a group!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		ИначеЕсли типЗнч(ДанныеСтр.Ссылка) = Тип("СправочникСсылка.торо_СтруктурыОР") Тогда
			ТекстСообщения = НСтр("es='¡No es posible escoger la raíz!';ru='Нельзя выбирать корень!';en='Can not choose a root!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		ИначеЕсли ДанныеСтр.ПометкаУдаления = Истина Тогда
			НаличиеДанныхПомеченныхНаУдаление = Истина;
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	
	ДопПараметры = Новый Структура("МассивВыбранныхСтрок", МассивВыбранныхСтрок);
	
	Если НаличиеДанныхПомеченныхНаУдаление Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗначенияПослеПроверкиПометкиУдаления", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = НСтр("es='Los datos escogidos son marcados a la desaparición. "
"¿Cumplir la elección de estos datos?';ru='Выбранные данные помечены на удаление."
"Выполнить выбор этих данных?';en='The selected data is marked for deletion."
"Select this data?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыборЗначенияПослеПроверкиПометкиУдаления(КодВозвратаДиалога.Да, ДопПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборЗначенияПослеПроверкиПометкиУдаления(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	МассивВыбранныхСтрок = ДополнительныеПараметры.МассивВыбранныхСтрок;

	МассивОР = Новый массив;
	Для каждого ТекДанные из МассивВыбранныхСтрок Цикл
		МассивОР.Добавить(ТекДанные.Ссылка);
	КонецЦикла;
	
	Если Элементы.ПанельНастроекПодбора.Видимость = Ложь Тогда
		ВыполнитьОповещениеОВыборе(МассивОР);
	Иначе
		
		Если Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.НастройкаПодбораВидаРемонтов Тогда
			ПодборСтраница_НастройкаПодбораВидаРемонтов(МассивОР);
		ИначеЕсли Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.НастройкаПодбораВидаПараметровНаработки Тогда
			ПодборСтраница_НастройкаПодбораВидаПараметровНаработки(МассивОР);
		ИначеЕсли Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.НастройкаПодбораКонтролируемыхПоказателей Тогда
			ПодборСтраница_НастройкаПодбораКонтролируемыхПоказателей(МассивОР);
		ИначеЕсли Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.НастройкаПодбораВводНачальныхДанных Тогда
			ПодборСтраница_НастройкаПодбораВводНачальныхДанных(МассивОР);
		ИначеЕсли Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.НастройкаПодбораСостоянияОР Тогда
			ПодборСтраница_НастройкаПодбораСостоянияОР(МассивОР);
		ИначеЕсли Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.НастройкаПодбораТиповойОР Тогда
			ПодборСтраница_НастройкаПодбораТиповойОР(МассивОР);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСтраница_НастройкаПодбораВидаРемонтов(МассивОР)
	
	СоответствиеОР = ПолучитьСоответствиеОРИВидовРемонта(МассивОР, ТолькоВидыРемонтовППР);
	
	Если СоответствиеОР.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='Para los objetos escogidos de la reparación no son indicadas las normas de la planificación o no los tipos de la reparación que participan en la planificación.';ru='Для выбранных объектов ремонта не указаны нормативы планирования или нет видов ремонта, участвующих в планировании.';en='For the selected repair objects, planning standards are not indicated or there are no types of repairs involved in the planning.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьВидРемонтныхРабот Тогда
		ОбщийСписокВидовРемонта = ПолучитьСписокРазличныхЗначенийИзСоответствия(СоответствиеОР);
		
		ДопПараметры = Новый Структура("СоответствиеОР", СоответствиеОР);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораИзСпискаЗначенийБезПродолжения", ЭтотОбъект, ДопПараметры);
		ТекстЗаголовкаОкна = НСтр("es='Escojan los tipos de los trabajos de reparación';ru='Выберите виды ремонтных работ';en='Choose types of repair work'");
		ОбщийСписокВидовРемонта.ПоказатьОтметкуЭлементов(ОписаниеОповещения, ТекстЗаголовкаОкна);
		
	Иначе
		ВыполнитьОповещениеОВыборе(СоответствиеОР);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСтраница_НастройкаПодбораВидаПараметровНаработки(МассивОР)
	
	ДопПоляДляСтруктурыВозврата = Новый Структура;
	ДопПоляДляСтруктурыВозврата.Вставить("ДатаСнятия", ДатаСнятияПоказателей);
	ДопПоляДляСтруктурыВозврата.Вставить("ПроставлятьПлановуюНаработку", ПроставлятьПлановуюНаработку);
	ДопПоляДляСтруктурыВозврата.Вставить("УчитыватьПростои", УчитыватьПростоиОР);

	СоответствиеОР = ПолучитьСоответствиеОРИПараметровНаработки(МассивОР);
	
	Если СоответствиеОР.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='Para los objetos escogidos de la reparación no son dados los parámetros de la elaboración.';ru='Для выбранных объектов ремонта не заданы параметры наработки.';en='Running hours are not set for the selected repair objects.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьВидПараметровНаработки Тогда
		ОбщийСписокПараметровНаработки = ПолучитьСписокРазличныхЗначенийИзСоответствия(СоответствиеОР);
		
		ДопПараметры = Новый Структура("СоответствиеОР, ДопПоляДляСтруктурыВозврата", СоответствиеОР, ДопПоляДляСтруктурыВозврата);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораИзСпискаЗначенийБезПродолжения", ЭтотОбъект, ДопПараметры);
		ТекстЗаголовкаОкна = НСтр("es='Escojan los tipos de los parámetros de la elaboración';ru='Выберите виды параметров наработки';en='Select the types of running hours'");
		ОбщийСписокПараметровНаработки.ПоказатьОтметкуЭлементов(ОписаниеОповещения, ТекстЗаголовкаОкна);
		
	Иначе
		ВыполнитьОповещениеОВыборе(СоответствиеОР, ДопПоляДляСтруктурыВозврата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСтраница_НастройкаПодбораКонтролируемыхПоказателей(МассивОР)
	
	СоответствиеОР = ПолучитьСоответствиеОРИКонтролируемыхПоказателей(МассивОР);
	
	Если СоответствиеОР.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='Para los objetos escogidos de la reparación no son dados los índices controlados.';ru='Для выбранных объектов ремонта не заданы контролируемые показатели.';en='For the selected repair objects, no controlled indicators are set.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьКонтролируемыеПоказатели Тогда
		ОбщийСписокПоказателей = ПолучитьСписокРазличныхЗначенийИзСоответствия(СоответствиеОР);
		
		ДопПараметры = Новый Структура("СоответствиеОР", СоответствиеОР);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораИзСпискаЗначенийБезПродолжения", ЭтотОбъект, ДопПараметры);
		ТекстЗаголовкаОкна = НСтр("es='Escojan los tipos de los índices controlados';ru='Выберите виды контролируемых показателей';en='Choose types of indicators to be monitored'");
		ОбщийСписокПоказателей.ПоказатьОтметкуЭлементов(ОписаниеОповещения, ТекстЗаголовкаОкна);
		
	Иначе
		ВыполнитьОповещениеОВыборе(СоответствиеОР);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСтраница_НастройкаПодбораВводНачальныхДанных(МассивОР)
	
	ДопПоляДляСтруктурыВозврата = Новый Структура;
	ДопПоляДляСтруктурыВозврата.Вставить("ЗаполнитьПоНормативам", ЗаполнитьПоНормативам);
	
	Если ЗаполнитьПоНормативам Тогда
		ДопПоляДляСтруктурыВозврата.Вставить("ЗапрашиватьВидРемонтныхРабот", ВводДанныхЗапрашиватьВидРемонтныхРабот);
		ДопПоляДляСтруктурыВозврата.Вставить("ЗапрашиватьВидПараметровНаработки", ВводДанныхЗапрашиватьВидПараметровНаработки);
		ДопПоляДляСтруктурыВозврата.Вставить("ЗапрашиватьВидИзмеряемыхПоказателей", ВводДанныхЗапрашиватьВидИзмеряемыхПоказателей);
		
		СоответствиеОР_ВидыРемонта = ПолучитьСоответствиеОРИВидовРемонта(МассивОР, Ложь);
		ДопПоляДляСтруктурыВозврата.Вставить("СоответствиеОР_ВидыРемонта", СоответствиеОР_ВидыРемонта);
		
		СоответствиеОР_ПараметрыНаработки = ПолучитьСоответствиеОРИПараметровНаработки(МассивОР);
		ДопПоляДляСтруктурыВозврата.Вставить("СоответствиеОР_ПараметрыНаработки", СоответствиеОР_ПараметрыНаработки);
		
		СоответствиеОР_ИзмеряемыеПоказатели = ПолучитьСоответствиеОРИКонтролируемыхПоказателей(МассивОР);
		ДопПоляДляСтруктурыВозврата.Вставить("СоответствиеОР_ИзмеряемыеПоказатели", СоответствиеОР_ИзмеряемыеПоказатели);
	КонецЕсли;
	
	ВыполнитьОповещениеОВыборе(МассивОР, ДопПоляДляСтруктурыВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСтраница_НастройкаПодбораСостоянияОР(МассивОР)
	
	ДопПоляДляСтруктурыВозврата = Новый Структура;
	ДопПоляДляСтруктурыВозврата.Вставить("ДатаНачала", ДатаНачалаУмолчание);
	ДопПоляДляСтруктурыВозврата.Вставить("ДатаОкончания", ДатаОкончанияУмолчание);
	
	ВыполнитьОповещениеОВыборе(МассивОР, ДопПоляДляСтруктурыВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСтраница_НастройкаПодбораТиповойОР(МассивОР)
	
	ДопПоляДляСтруктурыВозврата = Новый Структура;
	ДопПоляДляСтруктурыВозврата.Вставить("ИзменитьНаправлениеИИзготовителя", ИзменитьНаправлениеИИзготовителя);
	
	ВыполнитьОповещениеОВыборе(МассивОР, ДопПоляДляСтруктурыВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзСпискаЗначенийБезПродолжения(СписокЗначенийСПометками, ДопПараметры) Экспорт
	
	Если СписокЗначенийСПометками = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеОР = ДопПараметры.СоответствиеОР;
	
	ДопПоляДляСтруктурыВозврата = Неопределено;
	ДопПараметры.Свойство("ДопПоляДляСтруктурыВозврата", ДопПоляДляСтруктурыВозврата);
	
	ОтфильтрованноеСоответствиеОР = ОтфильтроватьСоответствиеОРПоМассивуВыбранныхЗначений(СоответствиеОР, СписокЗначенийСПометками);
	
	ВыполнитьОповещениеОВыборе(ОтфильтрованноеСоответствиеОР, ДопПоляДляСтруктурыВозврата);
	
КонецПроцедуры
	
#КонецОбласти

// Оповещение о закрытии, вызывается при выполнении команды "Настройка иерархии".
&НаКлиенте
Процедура НастройкаИерархииЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТекСтруктураИерархии = ВыбранноеЗначение.СтруктураИерархии;
		ОбработатьИзменениеИерархииНаСервере();
		торо_РаботаСИерархией20Клиент.ОбработатьИзменениеИерархииНаКлиенте(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеИерархииНаСервере()
	
	торо_РаботаСИерархией20.ОбработатьИзменениеИерархииНаСервере(ЭтаФорма, Список, Дерево, ФОИспользоватьДокументыЖЦОборудования, СписокСтатусов,,ДополнительныеОтборы);
	
	КореньПолногоДерева = Неопределено;
	ДеревоПолное.ПолучитьЭлементы().Очистить();
	
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовДереваНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыНазначенияИспользования(Параметры)
	
	ВидПодбора = "";
	
	Если Параметры.КлючНазначенияИспользования      = "торо_ПланГрафикРемонта" 
		ИЛИ Параметры.КлючНазначенияИспользования   = "торо_КалькуляторРЦ" Тогда 
		
		ВидПодбора = "ВидРемонтныхРабот";
		
	ИначеЕсли Параметры.КлючНазначенияИспользования = "торо_УчетКонтролируемыхПоказателей" Тогда 
		
		ВидПодбора = "КонтролируемыеПоказатели";
		
	ИначеЕсли Параметры.КлючНазначенияИспользования = "торо_УчетНаработкиОборудования"
		ИЛИ Параметры.КлючНазначенияИспользования   = "торо_УстановкаПроизвольногоЗначенияНаработки" Тогда 
		
		ВидПодбора = "ВидПараметровНаработки"; 	
		
		Если Параметры.Свойство("ДатаСнятияПоказателей") И ЗначениеЗаполнено(Параметры.ДатаСнятияПоказателей) Тогда
			ДатаСнятияПоказателей = Параметры.ДатаСнятияПоказателей;
		Иначе
			ДатаСнятияПоказателей = ТекущаяДата();
		КонецЕсли;
		
	ИначеЕсли Параметры.КлючНазначенияИспользования = "торо_ВводНачальныхДанных" Тогда 
		
		ВидПодбора = "ВводНачальныхДанных";
		
	ИначеЕсли Параметры.КлючНазначенияИспользования = "торо_СостоянияОбъектовРемонта" Тогда 
		
		ВидПодбора = "СостоянияОР";
		
		Если Параметры.Свойство("ВидОперации") И Параметры.ВидОперации = Перечисления.торо_ВидыОперацийОтклоненияВРаботеОборудования.ВидЭксплуатации Тогда
			Элементы.ДатаНачалаУмолчание.Заголовок = НСтр("es='La fecha del cambio del estado:';ru='Дата изменения состояния:';en='Date of state change:'");
			Элементы.ДатаОкончанияУмолчание.Видимость = Ложь;
		КонецЕсли;	
		
	ИначеЕсли Параметры.КлючНазначенияИспользования = "торо_ТиповыеОР" Тогда
		
		ВидПодбора = "ТиповыеОР";
		ИзменитьНаправлениеИИзготовителя = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()
	
	Если ВидПодбора = "ВидРемонтныхРабот" Тогда 
		Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.НастройкаПодбораВидаРемонтов;
	ИначеЕсли ВидПодбора = "ВидПараметровНаработки" Тогда 		
		Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.НастройкаПодбораВидаПараметровНаработки;
	ИначеЕсли ВидПодбора = "КонтролируемыеПоказатели" Тогда 		
		Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.НастройкаПодбораКонтролируемыхПоказателей;
	ИначеЕсли ВидПодбора = "ВводНачальныхДанных" Тогда 		
		Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.НастройкаПодбораВводНачальныхДанных;
		ОбновитьДоступностьФлагов();
	ИначеЕсли ВидПодбора = "СостоянияОР" Тогда
		Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.НастройкаПодбораСостоянияОР;
	ИначеЕсли ВидПодбора = "ТиповыеОР" Тогда
		Элементы.ПанельНастроекПодбора.ТекущаяСтраница = Элементы.НастройкаПодбораТиповойОР;
	Иначе
		Элементы.ПанельНастроекПодбора.Видимость = Ложь;	
	КонецЕсли;
	
	Элементы.ТолькоВидыРемонтовППР.Видимость = Ложь;
	Если КлючНазначенияИспользования = "торо_ПланГрафикРемонта" Тогда
		Элементы.ТолькоВидыРемонтовППР.Видимость = Истина;
		ТолькоВидыРемонтовППР = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьФлагов()
	
	Элементы.ВводДанныхЗапрашиватьВидПараметровНаработки.Доступность = ЗаполнитьПоНормативам;
	Элементы.ВводДанныхЗапрашиватьВидИзмеряемыхПоказателей.Доступность = ЗаполнитьПоНормативам;
	Элементы.ВводДанныхЗапрашиватьВидРемонтныхРабот.Доступность = ЗаполнитьПоНормативам;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСоответствиеОРИВидовРемонта(МассивОР, ТолькоВидыРемонтовППР)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_НормативныеРемонтыОборудования.ВидРемонта КАК ВидРемонта,
	|	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании КАК НеУчаствуетВПланировании
	|ИЗ
	|	РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|ГДЕ
	|	торо_НормативныеРемонтыОборудования.ОбъектРемонта В(&МассивОР)
	|	И торо_НормативныеРемонтыОборудования.Приоритет
	|	И торо_НормативныеРемонтыОборудования.ВидРемонта.ПланГрафикППР = ИСТИНА
	|ИТОГИ ПО
	|	ОбъектРемонта";
	
	Если ТолькоВидыРемонтовППР <> Истина Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И торо_НормативныеРемонтыОборудования.ВидРемонта.ПланГрафикППР = ИСТИНА", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОР", МассивОР);
	
	ВыборкаОР = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОбъектРемонта");
	
	СоответствиеОР = Новый Соответствие;
	
	Пока ВыборкаОР.Следующий() Цикл
		МассивВидовРемонта = Новый массив;
		ВыборкаВидовРемонта = ВыборкаОР.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаВидовРемонта.Следующий() Цикл
			Если ВыборкаВидовРемонта.НеУчаствуетВПланировании Тогда
			    ШаблонСообщения = НСтр("es='¡Para el objeto de la reparación ""%1"" tipo de los trabajos de reparación ""%2"" no participa en la planificación!';ru='Для объекта ремонта ""%1"" вид ремонтных работ ""%2"" не участвует в планировании!';en='For the repair object ""% 1"" the type of repair work ""% 2"" is not involved in the planning!'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(ВыборкаВидовРемонта.ОбъектРемонта), Строка(ВыборкаВидовРемонта.ВидРемонта));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецЕсли; 
			МассивВидовРемонта.Добавить(ВыборкаВидовРемонта.ВидРемонта);
		КонецЦикла;
		
		СоответствиеОР.Вставить(ВыборкаОР.ОбъектРемонта, МассивВидовРемонта);
	КонецЦикла;
	
	Возврат СоответствиеОР;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСоответствиеОРИПараметровНаработки(МассивОР)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних.Показатель КАК Показатель
	|ИЗ
	|	РегистрСведений.торо_ПараметрыНаработкиОбъектовРемонта.СрезПоследних(, ОбъектРемонта В (&МассивОР)) КАК торо_ПараметрыНаработкиОбъектовРемонтаСрезПоследних
	|ИТОГИ ПО
	|	ОбъектРемонта";
	
	Запрос.УстановитьПараметр("МассивОР", МассивОР);
	
	ВыборкаОР = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОбъектРемонта");
	
	СоответствиеОР = Новый Соответствие;
	
	Пока ВыборкаОР.Следующий() Цикл
		МассивПоказателейНаработки = Новый массив;
		ВыборкаПараметровНаработки = ВыборкаОР.Выбрать(ОбходРезультатаЗапроса.Прямой);
		Пока ВыборкаПараметровНаработки.Следующий() Цикл
			МассивПоказателейНаработки.Добавить(ВыборкаПараметровНаработки.Показатель);
		КонецЦикла;
		
		СоответствиеОР.Вставить(ВыборкаОР.ОбъектРемонта, МассивПоказателейНаработки);
	КонецЦикла;
	
	Возврат СоответствиеОР;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСоответствиеОРИКонтролируемыхПоказателей(МассивОР)

	СоответствиеОР = Новый Соответствие;
	ТаблицаПоказателей = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(МассивОР,,Ложь);
	
	Для каждого СтрокаТаблицы из ТаблицаПоказателей Цикл
		ЗначениеСоответствия = СоответствиеОР[СтрокаТаблицы.ОбъектРемонта];
		Если ЗначениеСоответствия = Неопределено Тогда
			ЗначениеСоответствия = Новый Массив;
		КонецЕсли;
		
		ЗначениеСоответствия.Добавить(СтрокаТаблицы.Показатель);
		СоответствиеОР.Вставить(СтрокаТаблицы.ОбъектРемонта, ЗначениеСоответствия);
	КонецЦикла;
	
	Возврат СоответствиеОР;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСписокРазличныхЗначенийИзСоответствия(СоответствиеОР)
	
	ОбщийСписок = Новый СписокЗначений;
	Для каждого КлючИЗначение из СоответствиеОР Цикл
		Для каждого ЭлементМассива из КлючИЗначение.Значение Цикл
			Если ОбщийСписок.НайтиПоЗначению(ЭлементМассива) = Неопределено Тогда
				ОбщийСписок.Добавить(ЭлементМассива,,Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОбщийСписок.СортироватьПоЗначению();

	Возврат ОбщийСписок;
	
КонецФункции

&НаКлиенте
Функция ОтфильтроватьСоответствиеОРПоМассивуВыбранныхЗначений(СоответствиеОР, СписокЗначенийСПометками)
	
	ОтфильтрованноеСоответствиеОР = Новый Соответствие;
	
	ВыбранныеЗначения = Новый Массив;
	Для каждого ЭлементСписка из СписокЗначенийСПометками Цикл
		Если ЭлементСписка.Пометка Тогда
			ВыбранныеЗначения.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ВыбранныеЗначения.Количество() = 0 Тогда
		Возврат ОтфильтрованноеСоответствиеОР;
	КонецЕсли;
	
	Для каждого КлючИЗначение из СоответствиеОР Цикл
		ОтобранныеЗначения = Новый Массив;
		Для каждого ЭлементМассива из КлючИЗначение.Значение Цикл
			Если ВыбранныеЗначения.Найти(ЭлементМассива) <> Неопределено Тогда
				ОтобранныеЗначения.Добавить(ЭлементМассива);
			КонецЕсли;
		КонецЦикла;
		
		Если ОтобранныеЗначения.Количество() > 0 Тогда
			ОтфильтрованноеСоответствиеОР.Вставить(КлючИЗначение.Ключ, ОтобранныеЗначения);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтфильтрованноеСоответствиеОР;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОповещениеОВыборе(МассивОР, ДопПоляДляСтруктурыВозврата = Неопределено)
	
	Если МассивОР.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	стрПараметров = Новый Структура;
	
	Если ТипЗнч(МассивОР) = Тип("Соответствие") Тогда
		стрПараметров.Вставить("СоответствиеОбъектовРемонта", МассивОР);
	Иначе
		стрПараметров.Вставить("ОбъектРемонта", МассивОР);
	КонецЕсли;
		
	Если ВернутьИерархию Тогда
		стрПараметров.Вставить("Иерархия", ТекСтруктураИерархии);
	КонецЕсли;
	
	Если ДопПоляДляСтруктурыВозврата <> Неопределено Тогда
		Для каждого КлючИЗначение из ДопПоляДляСтруктурыВозврата Цикл
			стрПараметров.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ОповеститьОВыборе(стрПараметров);
	
КонецПроцедуры

&НаСервере 
Процедура ОбновитьКартинкиЭлементовПолногоДереваНаСервере()
	торо_РаботаСИерархией20.ОбновитьКартинкиЭлементовПолногоДереваНаСервере(ДеревоПолное);
КонецПроцедуры

&НаСервере 
Процедура ОбновитьКартинкиЭлементовДереваНаСервере(ИдентификаторСтроки = 0)
	торо_РаботаСИерархией20.ОбновитьКартинкиЭлементовДереваНаСервере(Дерево, ИдентификаторСтроки);
КонецПроцедуры
#КонецОбласти
